my_reddit/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
  def new
    @post = Post.new
    @subs = Sub.all

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "this is a title"], ["url", ""], ["content", "whatever"], ["author_id", 1], ["created_at", "2019-02-06 00:22:06.779682"], ["updated_at", "2019-02-06 00:22:06.779682"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save